redis_benchmark/test/withPolicy8_1000000.txt
====== GET ======
  1000000 requests completed in 0.96 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 59.487 milliseconds (cumulative count 1000)
50.000% <= 641.535 milliseconds (cumulative count 504000)
75.000% <= 671.231 milliseconds (cumulative count 752000)
87.500% <= 685.055 milliseconds (cumulative count 875000)
93.750% <= 694.271 milliseconds (cumulative count 942000)
96.875% <= 696.319 milliseconds (cumulative count 969000)
98.438% <= 698.879 milliseconds (cumulative count 991000)
99.219% <= 699.391 milliseconds (cumulative count 999000)
99.902% <= 699.903 milliseconds (cumulative count 1000000)
100.000% <= 699.903 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.100% <= 60.127 milliseconds (cumulative count 1000)
1.400% <= 69.119 milliseconds (cumulative count 14000)
2.500% <= 70.143 milliseconds (cumulative count 25000)
3.800% <= 76.159 milliseconds (cumulative count 38000)
5.200% <= 77.119 milliseconds (cumulative count 52000)
5.700% <= 78.143 milliseconds (cumulative count 57000)
7.100% <= 79.103 milliseconds (cumulative count 71000)
8.600% <= 80.127 milliseconds (cumulative count 86000)
10.200% <= 81.151 milliseconds (cumulative count 102000)
11.700% <= 82.111 milliseconds (cumulative count 117000)
12.200% <= 83.135 milliseconds (cumulative count 122000)
12.700% <= 596.479 milliseconds (cumulative count 127000)
14.000% <= 597.503 milliseconds (cumulative count 140000)
15.600% <= 601.599 milliseconds (cumulative count 156000)
16.400% <= 602.111 milliseconds (cumulative count 164000)
17.400% <= 603.135 milliseconds (cumulative count 174000)
17.900% <= 605.183 milliseconds (cumulative count 179000)
18.900% <= 606.207 milliseconds (cumulative count 189000)
19.700% <= 608.255 milliseconds (cumulative count 197000)
20.700% <= 609.279 milliseconds (cumulative count 207000)
22.300% <= 610.303 milliseconds (cumulative count 223000)
23.200% <= 611.327 milliseconds (cumulative count 232000)
23.700% <= 612.351 milliseconds (cumulative count 237000)
25.300% <= 613.375 milliseconds (cumulative count 253000)
26.800% <= 614.399 milliseconds (cumulative count 268000)
27.700% <= 615.423 milliseconds (cumulative count 277000)
29.300% <= 617.471 milliseconds (cumulative count 293000)
30.800% <= 618.495 milliseconds (cumulative count 308000)
32.400% <= 619.519 milliseconds (cumulative count 324000)
34.000% <= 620.543 milliseconds (cumulative count 340000)
35.600% <= 621.567 milliseconds (cumulative count 356000)
37.000% <= 622.591 milliseconds (cumulative count 370000)
37.200% <= 623.103 milliseconds (cumulative count 372000)
38.600% <= 624.127 milliseconds (cumulative count 386000)
39.800% <= 625.151 milliseconds (cumulative count 398000)
41.100% <= 629.247 milliseconds (cumulative count 411000)
42.700% <= 630.271 milliseconds (cumulative count 427000)
43.900% <= 631.295 milliseconds (cumulative count 439000)
44.200% <= 632.319 milliseconds (cumulative count 442000)
45.700% <= 633.343 milliseconds (cumulative count 457000)
47.000% <= 634.367 milliseconds (cumulative count 470000)
47.300% <= 636.415 milliseconds (cumulative count 473000)
48.300% <= 637.439 milliseconds (cumulative count 483000)
49.900% <= 638.463 milliseconds (cumulative count 499000)
50.400% <= 641.535 milliseconds (cumulative count 504000)
51.500% <= 642.559 milliseconds (cumulative count 515000)
53.000% <= 643.583 milliseconds (cumulative count 530000)
54.000% <= 644.607 milliseconds (cumulative count 540000)
54.600% <= 645.119 milliseconds (cumulative count 546000)
55.100% <= 646.143 milliseconds (cumulative count 551000)
56.000% <= 647.167 milliseconds (cumulative count 560000)
56.500% <= 648.191 milliseconds (cumulative count 565000)
56.700% <= 651.263 milliseconds (cumulative count 567000)
58.300% <= 652.287 milliseconds (cumulative count 583000)
59.700% <= 653.311 milliseconds (cumulative count 597000)
60.000% <= 656.383 milliseconds (cumulative count 600000)
61.200% <= 657.407 milliseconds (cumulative count 612000)
62.700% <= 658.431 milliseconds (cumulative count 627000)
63.600% <= 659.455 milliseconds (cumulative count 636000)
63.800% <= 662.527 milliseconds (cumulative count 638000)
65.400% <= 663.551 milliseconds (cumulative count 654000)
66.700% <= 664.575 milliseconds (cumulative count 667000)
68.000% <= 665.599 milliseconds (cumulative count 680000)
68.700% <= 666.111 milliseconds (cumulative count 687000)
70.000% <= 667.135 milliseconds (cumulative count 700000)
71.400% <= 668.159 milliseconds (cumulative count 714000)
72.600% <= 669.183 milliseconds (cumulative count 726000)
73.900% <= 670.207 milliseconds (cumulative count 739000)
75.200% <= 671.231 milliseconds (cumulative count 752000)
75.800% <= 672.255 milliseconds (cumulative count 758000)
77.300% <= 673.279 milliseconds (cumulative count 773000)
77.800% <= 674.303 milliseconds (cumulative count 778000)
78.600% <= 676.351 milliseconds (cumulative count 786000)
79.800% <= 677.375 milliseconds (cumulative count 798000)
80.800% <= 680.447 milliseconds (cumulative count 808000)
82.100% <= 681.471 milliseconds (cumulative count 821000)
83.500% <= 682.495 milliseconds (cumulative count 835000)
85.100% <= 683.519 milliseconds (cumulative count 851000)
86.700% <= 684.543 milliseconds (cumulative count 867000)
88.300% <= 685.567 milliseconds (cumulative count 883000)
88.500% <= 686.591 milliseconds (cumulative count 885000)
88.600% <= 689.151 milliseconds (cumulative count 886000)
89.800% <= 691.199 milliseconds (cumulative count 898000)
91.400% <= 692.223 milliseconds (cumulative count 914000)
93.000% <= 693.247 milliseconds (cumulative count 930000)
94.200% <= 694.271 milliseconds (cumulative count 942000)
95.700% <= 695.295 milliseconds (cumulative count 957000)
96.900% <= 696.319 milliseconds (cumulative count 969000)
98.300% <= 698.367 milliseconds (cumulative count 983000)
99.900% <= 699.391 milliseconds (cumulative count 999000)
100.000% <= 700.415 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1042752.88 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      579.151    59.456   641.535   695.295   698.879   699.903