redis_benchmark/test/withPolicy9_1000000.txt
====== GET ======
  1000000 requests completed in 0.70 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 41.695 milliseconds (cumulative count 1000)
50.000% <= 284.927 milliseconds (cumulative count 502000)
75.000% <= 305.151 milliseconds (cumulative count 751000)
87.500% <= 317.439 milliseconds (cumulative count 877000)
93.750% <= 322.815 milliseconds (cumulative count 939000)
96.875% <= 328.447 milliseconds (cumulative count 969000)
98.438% <= 329.471 milliseconds (cumulative count 985000)
99.219% <= 329.983 milliseconds (cumulative count 993000)
99.609% <= 330.495 milliseconds (cumulative count 997000)
99.805% <= 331.007 milliseconds (cumulative count 1000000)
100.000% <= 331.007 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.700% <= 42.111 milliseconds (cumulative count 7000)
2.200% <= 43.103 milliseconds (cumulative count 22000)
3.700% <= 44.127 milliseconds (cumulative count 37000)
4.800% <= 45.119 milliseconds (cumulative count 48000)
6.300% <= 46.111 milliseconds (cumulative count 63000)
7.800% <= 47.103 milliseconds (cumulative count 78000)
9.400% <= 48.127 milliseconds (cumulative count 94000)
10.800% <= 49.119 milliseconds (cumulative count 108000)
11.500% <= 50.111 milliseconds (cumulative count 115000)
12.700% <= 247.167 milliseconds (cumulative count 127000)
13.200% <= 248.191 milliseconds (cumulative count 132000)
14.100% <= 249.215 milliseconds (cumulative count 141000)
15.300% <= 250.111 milliseconds (cumulative count 153000)
16.500% <= 251.135 milliseconds (cumulative count 165000)
17.700% <= 252.159 milliseconds (cumulative count 177000)
19.000% <= 253.183 milliseconds (cumulative count 190000)
19.200% <= 254.207 milliseconds (cumulative count 192000)
20.300% <= 255.103 milliseconds (cumulative count 203000)
21.200% <= 256.127 milliseconds (cumulative count 212000)
22.000% <= 257.151 milliseconds (cumulative count 220000)
23.000% <= 258.175 milliseconds (cumulative count 230000)
24.000% <= 259.199 milliseconds (cumulative count 240000)
24.300% <= 260.223 milliseconds (cumulative count 243000)
25.100% <= 261.119 milliseconds (cumulative count 251000)
26.700% <= 262.143 milliseconds (cumulative count 267000)
27.500% <= 263.167 milliseconds (cumulative count 275000)
29.100% <= 264.191 milliseconds (cumulative count 291000)
29.600% <= 265.215 milliseconds (cumulative count 296000)
30.900% <= 266.239 milliseconds (cumulative count 309000)
32.400% <= 267.263 milliseconds (cumulative count 324000)
32.700% <= 268.287 milliseconds (cumulative count 327000)
33.900% <= 269.311 milliseconds (cumulative count 339000)
35.400% <= 270.335 milliseconds (cumulative count 354000)
36.000% <= 271.103 milliseconds (cumulative count 360000)
36.100% <= 273.151 milliseconds (cumulative count 361000)
37.600% <= 274.175 milliseconds (cumulative count 376000)
38.000% <= 275.199 milliseconds (cumulative count 380000)
39.600% <= 276.223 milliseconds (cumulative count 396000)
40.700% <= 277.247 milliseconds (cumulative count 407000)
42.300% <= 278.271 milliseconds (cumulative count 423000)
43.900% <= 279.295 milliseconds (cumulative count 439000)
45.200% <= 280.319 milliseconds (cumulative count 452000)
46.100% <= 281.343 milliseconds (cumulative count 461000)
46.400% <= 282.111 milliseconds (cumulative count 464000)
47.400% <= 283.135 milliseconds (cumulative count 474000)
49.000% <= 284.159 milliseconds (cumulative count 490000)
50.200% <= 285.183 milliseconds (cumulative count 502000)
51.700% <= 287.231 milliseconds (cumulative count 517000)
53.300% <= 288.255 milliseconds (cumulative count 533000)
54.900% <= 289.279 milliseconds (cumulative count 549000)
56.500% <= 290.303 milliseconds (cumulative count 565000)
58.100% <= 291.327 milliseconds (cumulative count 581000)
59.700% <= 292.351 milliseconds (cumulative count 597000)
60.700% <= 293.119 milliseconds (cumulative count 607000)
61.600% <= 294.143 milliseconds (cumulative count 616000)
62.600% <= 295.167 milliseconds (cumulative count 626000)
63.400% <= 296.191 milliseconds (cumulative count 634000)
63.800% <= 297.215 milliseconds (cumulative count 638000)
65.300% <= 298.239 milliseconds (cumulative count 653000)
66.900% <= 299.263 milliseconds (cumulative count 669000)
68.500% <= 300.287 milliseconds (cumulative count 685000)
70.100% <= 301.311 milliseconds (cumulative count 701000)
71.500% <= 302.335 milliseconds (cumulative count 715000)
72.500% <= 303.103 milliseconds (cumulative count 725000)
73.500% <= 304.127 milliseconds (cumulative count 735000)
75.100% <= 305.151 milliseconds (cumulative count 751000)
76.200% <= 306.175 milliseconds (cumulative count 762000)
77.800% <= 307.199 milliseconds (cumulative count 778000)
79.000% <= 308.223 milliseconds (cumulative count 790000)
80.600% <= 309.247 milliseconds (cumulative count 806000)
81.400% <= 310.271 milliseconds (cumulative count 814000)
81.800% <= 311.295 milliseconds (cumulative count 818000)
82.900% <= 312.319 milliseconds (cumulative count 829000)
83.600% <= 313.343 milliseconds (cumulative count 836000)
84.800% <= 314.111 milliseconds (cumulative count 848000)
86.100% <= 316.159 milliseconds (cumulative count 861000)
87.300% <= 317.183 milliseconds (cumulative count 873000)
88.900% <= 318.207 milliseconds (cumulative count 889000)
89.500% <= 319.231 milliseconds (cumulative count 895000)
90.600% <= 320.255 milliseconds (cumulative count 906000)
92.200% <= 321.279 milliseconds (cumulative count 922000)
93.700% <= 322.303 milliseconds (cumulative count 937000)
94.400% <= 323.327 milliseconds (cumulative count 944000)
94.600% <= 324.351 milliseconds (cumulative count 946000)
95.100% <= 325.119 milliseconds (cumulative count 951000)
96.000% <= 326.143 milliseconds (cumulative count 960000)
96.600% <= 327.167 milliseconds (cumulative count 966000)
96.800% <= 328.191 milliseconds (cumulative count 968000)
98.100% <= 329.215 milliseconds (cumulative count 981000)
99.500% <= 330.239 milliseconds (cumulative count 995000)
100.000% <= 331.263 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 1424501.38 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      260.874    41.664   284.927   325.119   329.983   331.007